app/app/Modules/Gemini/Controllers/GeminiController.php

    public function index(): string
    {
        $userId = (int) session()->get('userId');
        $prompts = $this->promptModel->where('user_id', $userId)->findAll();
        $userSetting = $this->userSettingsModel->where('user_id', $userId)->first();
---
SELECT *
FROM `prompts`
WHERE `user_id` = 1
SELECT *
FROM `user_settings`
WHERE `user_id` = 1
 LIMIT 1

    public function generate(): RedirectResponse
    {
        $userId = (int) session()->get('userId');
        $user = $this->userModel->find($userId);

        if (!$user) return redirect()->back()->with('error', 'User not found.');

        $userSetting = $this->userSettingsModel->where('user_id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `user_settings`
WHERE `user_id` = 1
 LIMIT 1