app/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
UPDATE `users` SET `balance` = '125.06', `updated_at` = '2025-11-20 23:21:15'
WHERE `users`.`id` IN ('1')
---
    public function deductBalance(int $userId, string $amount, bool $allowOverdraft = true): bool
    {
        $this->db->transStart();

        /** @var User|null $user */
        $user = $this->find($userId);

        if (! $user) {
            $this->db->transRollback();
            return false;
        }

        $currentBalance = (string) ($user->balance ?? '0.00');
        $isSufficient = bccomp($currentBalance, $amount, 2) >= 0;

        if (! $isSufficient && ! $allowOverdraft) {
            $this->db->transRollback();
            return false;
        }

        // Perform deduction
        $user->balance = bcsub($currentBalance, $amount, 2);
        $this->save($user);